// 주석(Comment): 컴파일 x, 노트정리

// 바이트(Byte): 정보의 최소 단위 ☆
//  ㄴ 8Bit = 1Byte
//  ㄴ Bit = 0 or 1
//  ㄴ 모든 프로그래밍 언어는 값을 Byte 표현
//  ㄴ C언어는 Int(정수) -> 4Byte 표현 ☆
//  ㄴ 1Byte = 2^8 = 0~225(256) 
//  ㄴ 값을 표현할 때 큰 Byte를 할당하면 할수록 값의 범위도 커짐

// 문자 컴파일
//  ㄴ 문자 -> 2진수 형태의 ASCII코드로 변환
//  ㄴ Ex) 'A' -> 65 ☆
//  ㄴ자는 소스코드에서만 문자로 표현되고, 컴퓨터 안에서는
//    정수와 같은 방식으로 처리

// 문자 표현 방식
//  ㄴ UTF8(한글 표현) ☆
//  ㄴ 일반적으로 영어 알파벳은 2Byte ☆표현
//  ㄴ 일반적으로 한글은 3Byte ☆표현

// ASCII 코드
//  ㄴ 사람이 사용하는 기호를 컴퓨터 안에서 표현하는 방법
//  ㄴ https://www.ascii-codes.com/
